Repository: VasylVoloshyn/SaveMyCollections
Catalog: SaveMyCollections/Resources/CommonResources.*.resx
Languages: uk_ua

source: The type {0} must implement {1}.
uk_ua: Тип '{0}' повинен реалізовувати '{1}'.

source: The value '{0}' is invalid.
uk_ua: Значення '{0}' неприпустимо.

source: The value '{0}' is not valid for {1}.
uk_ua: Значення '{0}' неприпустимо для {1}.

source: The value '{0}' is not valid.
uk_ua: Значення '{0}' неприпустимо.

source: The value for property '{0}' must be of type '{1}'.
uk_ua: Значення властивості '{0}' має мати тип "{1} '.

source: The {0} field is not a valid credit card number.
uk_ua: Поле '{0}' не є допустимим номером кредитної картки.

source: The {0} field is not a valid e-mail address.
uk_ua: Поле '{0}' не є дійсною адресою електронної пошти.

source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
uk_ua: Поле '{0}' не є дійсним повністю кваліфікованим HTTP, HTTPS, FTP або URL.

source: The {0} field is not a valid phone number.
uk_ua: Поле '{0}' не є допустимим номером телефону.

source: The {0} field is required.
uk_ua: Поле '{0}' обов'язково для заповнення.

source: The {0} field only accepts files with the following extensions: {1}
uk_ua: Поле '{0}' приймає тільки файли з наступними розширеннями: {1}

source: The {0} property has not been set. Use the {1} method to get the value.
uk_ua: Властивість '{0}' не було встановлено. Використовуйте метод '{1}', щоб отримати значення.

source: There are no external authentication services configured. See &lt;a href='https://go.microsoft.com/fwlink/?LinkID=532715'&gt;this article&lt;/a&gt; for details on setting up this ASP.NET application to support logging in via external services.
uk_ua: Відсутні налаштовані зовнішні служби аутентифікації. Див. <a href='https://go.microsoft.com/fwlink/?LinkID=532715'> статтю </a> для інформації про налаштування цього додатка ASP.NET для підтримки входу в систему за допомогою зовнішніх сервісів.

source: This account has been locked out, please try again later.
uk_ua: Цей обліковий запис було заблоковано, будь ласка, спробуйте ще раз пізніше.

source: To enable QR code generation please read our &lt;a href=&quot;{0}&quot;&gt;documentation&lt;/a&gt;.
uk_ua: Для того, щоб дати можливість генерації QR-коду, будь ласка, ознайомтеся з нашою <a href="{0}"> документацією </a>.

source: To use an authenticator app go through the following steps:
uk_ua: Щоб використовувати додаток перевірки автентичності пройти наступні кроки:

source: Two-factor authentication
uk_ua: Двофакторна аутентифікація

source: Two-factor authentication (2FA)
uk_ua: Двофакторна аутентифікація (2FA)

source: Update password
uk_ua: Оновлення пароля

source: Use a local account to log in.
uk_ua: Використовуйте локальний обліковий запис для входу.

source: Use another service to log in.
uk_ua: Використовуйте іншу службу для входу.

source: Use this page to detail your site's privacy policy.
uk_ua: Використовуйте цю сторінку з детальною політикою конфіденційності вашого сайту.

source: Use this space to summarize your privacy and cookie use policy. &lt;a href=&quot;{0}&quot;&gt;Learn More&lt;/a&gt;.&#xA; &lt;button type=&quot;button&quot; class=&quot;accept-policy close&quot; data-dismiss=&quot;alert&quot; aria-label=&quot;Close&quot; data-cookie-string=&quot;{1}&quot;&gt;&#xA; &lt;span aria-hidden=&quot;true&quot;&gt;Accept&lt;/span&gt;&#xA; &lt;/button&gt;
uk_ua: Використовуйте це місце для короткого викладу вашої політики конфіденційності та використання файлів cookie. <a href="{0}"> Детальніше </a>. <button type="button" class="accept-policy close" data-dismiss="alert" aria-label="Close" data-cookie-string ="{1}"> <span aria-hidden="true"> Прийняти </span></button>

source: User already has a password set.
uk_ua: У користувача вже встановлено пароль.

source: User already in role '{0}'.
uk_ua: Користувач вже має роль '{0}'.

source: User is not in role '{0}'.
uk_ua: У користувача немає роль '{0}'.

source: User name '{0}' is already taken.
uk_ua: Ім'я користувача '{0}' вже зайнято.

source: User name '{0}' is invalid, can only contain letters or digits.
uk_ua: Ім'я користувача '{0}' неприпустимо, може містити тільки букви або цифри.

source: UserRoles
uk_ua: Ролі Користувачів

source: Verification Code
uk_ua: Код підтвердження

source: Verification email sent. Please check your email.
uk_ua: Лист з підтвердженням надіслано. Будь ласка, перевірте вашу електронну пошту.

source: Verify
uk_ua: Перевірити

source: Welcome
uk_ua: Ласкаво просимо

source: WikiLink
uk_ua: Посилання Wiki

source: Year
uk_ua: Рік

source: You do not have a local username/password for this site. Add a local account so you can log in without an external login.
uk_ua: У вас немає локального імені користувача / пароля для цього сайту. Додайте локальний обліковий запис, щоб ви могли увійти без зовнішніх пристроїв.

source: You do not have access to this resource.
uk_ua: У вас немає доступу до цього ресурсу.

source: You have generated new recovery codes.
uk_ua: Ви згенерували нові коди відновлення.

source: You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at log in or disable 2FA and log in again.
uk_ua: Ви запросили вхід з кодом відновлення. Цей користувач не буде запомнен до тих пір, поки ви не введете код додатка аутентифікатора при вході в систему або не вимкнете 2FA і не ввійдете знову.

source: You have successfully logged out of the application.
uk_ua: Ви успішно вийшли з додатку.

source: You've successfully authenticated with &lt;strong&gt;{0}&lt;/strong&gt;. Please enter an email address for this site below and click the Register button to finish logging in.
uk_ua: Ви успішно пройшли перевірку автентичності за допомогою <strong> {0} </ strong>. Будь ласка, введіть адресу електронної пошти для цього сайту нижче і натисніть кнопку Зареєструватися, щоб завершити вхід в систему.

source: Your authenticator app has been verified.
uk_ua: Ваше додаток для перевірки автентичності було перевірено.

source: Your authenticator app key has been reset, you will need to configure your authenticator app using the new key.
uk_ua: Ваш ключ додатка-аутентифікатора був скинутий, вам потрібно буде налаштувати додаток-аутентифікатор, використовуючи новий ключ.

source: Your login is protected with an authenticator app. Enter your authenticator code below.
uk_ua: Ваш логін захищений додатком-аутентифікатором. Введіть код аутентифікатора нижче.

source: Your password has been changed.
uk_ua: Ваш пароль був змінений.

source: Your password has been reset. Please &lt;a href=&quot;{0}&quot;&gt;click here to log in&lt;/a&gt;.
uk_ua: Ваш пароль був скинутий. Будь ласка, <a href="{0}"> натисніть тут для входу </a>.

source: Your password has been set.
uk_ua: Ваш пароль був встановлений.

source: Your profile has been updated
uk_ua: Ваш профіль був оновлений

source: {0} is not valid.
uk_ua: {0} не є дійсним.
