Repository: VasylVoloshyn/SaveMyCollections
Catalog: SaveMyCollections/Resources/CommonResources.*.resx
Languages: uk_ua

source: '{0}' and '{1}' do not match.
uk_ua: '{0}' і '{1}' не збігаються.

source: 2fa has been disabled. You can reenable 2fa when you setup an authenticator app
uk_ua: 2FA був відключений. Ви можете включити 2FA, налаштувавши додаток для аутентифікації.

source: &lt;p&gt;&#xA; &lt;span class=&quot;glyphicon glyphicon-warning-sign&quot;&gt;&lt;/span&gt;&#xA; &lt;strong&gt;If you reset your authenticator key your authenticator app will not work until you reconfigure it.&lt;/strong&gt;&#xA; &lt;/p&gt;&#xA; &lt;p&gt;&#xA; This process disables 2FA until you verify your authenticator app.&#xA; If you do not complete your authenticator app configuration you may lose access to your account.&#xA; &lt;/p&gt;
uk_ua: <p> <span class="glyphicon glyphicon-warning-sign"></span><strong> Якщо ви скинете свій ключ аутентифікації, ваше додаток аутентифікації не працюватиме, поки ви не переналаштувати його. </strong> </p> <p> Цей процес відключає двухфакторную аутентифікацію (2FA), поки ви не підтвердите свій додаток для перевірки автентичності. Якщо ви не завершите настройку програми-аутентифікатора, ви можете втратити доступ до свого облікового запису. </p>

source: &lt;p&gt;&#xA; &lt;span class=&quot;glyphicon glyphicon-warning-sign&quot;&gt;&lt;/span&gt;&#xA; &lt;strong&gt;Put these codes in a safe place.&lt;/strong&gt;&#xA; &lt;/p&gt;&#xA; &lt;p&gt;&#xA; If you lose your device and don't have the recovery codes you will lose access to your account.&#xA; &lt;/p&gt;&#xA; &lt;p&gt;&#xA; Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key&#xA; used in an authenticator app you should &lt;a href=&quot;{0}&quot;&gt;reset your authenticator keys.&lt;/a&gt;&#xA; &lt;/p&gt;
uk_ua: <p>Ваш обліковий запис містить особисті дані, які ви нам надали. Ця сторінка дозволяє завантажувати або видаляти ці дані.</p> <p><strong>Видалення цих даних призведе до видалення вашого профілю без можливості відновлення.</strong> </p>

source: &lt;p&gt;&#xA; Swapping to the &lt;strong&gt;Development&lt;/strong&gt; environment displays detailed information about the error that occurred.&#xA; &lt;/p&gt;&#xA; &lt;p&gt;&#xA; &lt;strong&gt;The Development environment shouldn't be enabled for deployed applications.&lt;/strong&gt; It can result in displaying sensitive information from exceptions to end users. For local debugging, enable the &lt;strong&gt;Development&lt;/strong&gt; environment by setting the &lt;strong&gt;ASPNETCORE_ENVIRONMENT&lt;/strong&gt; environment variable to &lt;strong&gt;Development&lt;/strong&gt; and restarting the app.&#xA; &lt;/p&gt;
uk_ua: <p> Якщо перейти в середу <strong>Development</strong>, відобразиться докладна інформація про виниклу помилку. </p> <p> <strong>Среду розробки не слід включати для розгорнутих додатків.</ strong> Це може привести до відображення від винятків конфіденційної інформації для кінцевих користувачів. Для локальної налагодження включите середу <strong> Development</strong>, задавши для перемінної <strong> ASPNETCORE_ENVIRONMENT</strong> значення <strong>Development</strong> і перезапустивши додаток. </p>

source: &lt;p&gt;Your account contains personal data that you have given us. This page allows you to download or delete that data.&lt;/p&gt;&#xA; &lt;p&gt;&#xA; &lt;strong&gt;Deleting this data will permanently remove your account, and this cannot be recovered.&lt;/strong&gt;&#xA; &lt;/p&gt;
uk_ua: <p>Ваш обліковий запис містить особисті дані, які ви нам надали. Ця сторінка дозволяє завантажувати або видаляти ці дані. </p> <p><strong>Видалення цих даних призведе до видалення вашого профілю без можливості відновлення.</strong> </p>

source: &lt;strong&gt;You have 1 recovery code left.&lt;/strong&gt;&#xA; &lt;p&gt;You can &lt;a href=&quot;{0}&quot;&gt;generate a new set of recovery codes&lt;/a&gt;.&lt;/p&gt;
uk_ua: <strong>У вас залишився 1 код відновлення.</strong> <p>Ви можете <a href="{0}"> створити новий набір кодів відновлення</a>. </p>

source: &lt;strong&gt;You have no recovery codes left.&lt;/strong&gt;&#xA; &lt;p&gt;You must &lt;a href=&quot;{0}&quot;&gt;generate a new set of recovery codes&lt;/a&gt; before you can log in with a recovery code.&lt;/p&gt;
uk_ua: <strong>У вас немає кодів відновлення.</strong> <p>Перед тим як увійти в систему за допомогою коду відновлення, ви повинні <a href="{0}"> створити новий набір кодів відновлення </a>.</p>

source: &lt;strong&gt;You have {0} recovery codes left.&lt;/strong&gt;&#xA; &lt;p&gt;You should &lt;a href=&quot;{1}&quot;&gt;generate a new set of recovery codes&lt;/a&gt;.&lt;/p&gt;
uk_ua: <strong>У вас залишилося {0} кодів відновлення. </strong> <p>Вам слід <a href="{1}"> створити новий набір кодів відновлення </a>. </ p>

source: A non-empty request body is required.
uk_ua: Потрібно непорожнє тіло запиту.

source: A user with this login already exists.
uk_ua: Користувач з таким іменем вже існує.

source: A value for the '{0}' parameter or property was not provided.
uk_ua: Не було представлено значення для '{0}' параметра або властивості.

source: A value is required.
uk_ua: Потрібно значення.

source: Access denied
uk_ua: Доступ заборонено

source: Add another service to log in.
uk_ua: Додати ще один сервіс для входу в систему.

source: Add authenticator app
uk_ua: Додати додаток аутентифікації

source: Admin
uk_ua: Адміністратор

source: An error occurred while processing your request.
uk_ua: Сталася помилка при обробці Вашого запиту.

source: An unknown failure has occurred.
uk_ua: Виникла невідома помилка.

source: Are you sure you want to delete this?
uk_ua: Ви впевнені, що хочете видалити ?

source: Associate your {0} account.
uk_ua: Зв'яжіть ваш {0} обліковий запис.

source: Avers
uk_ua: Фотографія лицьової сторони

source: BackToFullList
uk_ua: Повернутись до повного спису

source: BackToList
uk_ua: Повернутися до списку

source: Banknote
uk_ua: Банкнота

source: BanknoteGrades
uk_ua: Якість Банкнот

source: Banknotes
uk_ua: Банкноти

source: BanknotesCollectionDescription
uk_ua: Ось моя колекція банкнот.

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
uk_ua: Для цього атрибута повинні бути встановлені як ErrorMessageResourceType, так і ErrorMessageResourceName.

source: Cannot retrieve property '{0}' because localization failed. Type '{1}' is not public or does not contain a public static string property with the name '{2}'.
uk_ua: Неможливо отримати властивість '{0}', тому що локалізація не вдалося. Тип '{1}' не є загальнодоступним або не містить публічне статичну строкову властивість з ім'ям '{2}'.

source: Change password
uk_ua: Змінити пароль

source: Change your account settings
uk_ua: Зміна параметрів облікового запису

source: ChangeAvers
uk_ua: Змінити фотографію лицьової сторони

source: ChangePhoto
uk_ua: Змініть фотографію

source: ChangeRevers
uk_ua: Змінити фотографію зворотної сторони

source: Code
uk_ua: Код

source: Coin
uk_ua: Монета

source: CoinGrades
uk_ua: Якість Копійок

source: Coins
uk_ua: Монети

source: CoinsCollectionDescription
uk_ua: Ось моя колекція монет.

source: Configure authenticator app
uk_ua: Налаштування програми аутентифікації

source: Confirm email
uk_ua: Підтвердіть адресу електронної пошти

source: Confirm password
uk_ua: Підтвердження пароля

source: Confirm your email
uk_ua: Підтвердіть Вашу електронну адресу електронної пошти

source: Could not convert the value of type '{0}' to '{1}' as expected by method {2}.{3}.
uk_ua: Не вдалося перетворити значення типу '{0}' в '{1}', як очікувалося за методом {2}. {3}.

source: Could not find a property named {0}.
uk_ua: Не вдалося знайти властивість з ім'ям {0}.

source: Countries
uk_ua: Країни

source: Country
uk_ua: Країна

source: Create
uk_ua: Створити

source: Create a new account.
uk_ua: Створити новий акаунт.

source: CreateNew
uk_ua: Створити нову

source: Currencies
uk_ua: Валюти

source: Currency
uk_ua: Валюта

source: Date
uk_ua: Дата

source: Delete
uk_ua: Видалити

source: Details
uk_ua: Деталі

source: Development Mode
uk_ua: Режим розробки

source: Dime
uk_ua: Копійка

source: Dimes
uk_ua: Копійки

source: Disable 2FA
uk_ua: Відключити 2FA

source: Don't have access to your authenticator device? You can &lt;a id=&quot;recovery-code-login&quot; href=&quot;{0}&quot;&gt;log in with a recovery code&lt;/a&gt;.
uk_ua: У вас немає доступу до вашого пристрою аутентифікації? Ви можете <a id="recovery-code-login" href="{0}"> увійти з кодом відновлення </a>.

source: Download
uk_ua: Завантажити

source: Download a two-factor authenticator app like Microsoft Authenticator for &lt;a href=&quot;{0}&quot;&gt;Windows Phone&lt;/a&gt;, &lt;a href=&quot;{1}&quot;&gt;Android&lt;/a&gt; and &lt;a href=&quot;{2}&quot;&gt;iOS&lt;/a&gt; or
uk_ua: Завантажити додаток двухфакторної аутентифікації, як Microsoft Authenticator для <a href="{0}"> Windows Phone </a>, <a href="{1}"> Android </a> і <a href = "{2} "> iOS </a> або

source: Download Your Data
uk_ua: Завантажити ваші дані

source: Edit
uk_ua: Редагувати

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
uk_ua: Або ErrorMessageString або ErrorMessageResourceName повинні бути встановлені, але не обидва.

source: Email
uk_ua: Ел. адреса

source: Email '{0}' is already taken.
uk_ua: Ел. адреса '{0}' вже зайнята.

source: Email '{0}' is invalid.
uk_ua: Ел. адреса '{0}' є недійсною.

source: Enter your email.
uk_ua: Введіть адресу електронної пошти.

source: Error
uk_ua: Помилка

source: Error from external provider: {0}
uk_ua: Помилка від зовнішнього постачальника: {0}

source: Error loading external login information during confirmation.
uk_ua: Помилка завантаження зовнішньої інформації для входу під час підтвердження.

source: Error loading external login information.
uk_ua: Помилка завантаження зовнішньої інформації для входу.

source: External logins
uk_ua: Зовнішні входи

source: Forget this browser
uk_ua: Забудьте цей браузер

source: Forgot password confirmation
uk_ua: Забули підтвердження пароля

source: Forgot your password?
uk_ua: Забули пароль?

source: Generate Recovery Codes
uk_ua: Генерація кодів відновлення

source: Generate two-factor authentication (2FA) recovery codes
uk_ua: Генерація коду відновлення для двофакторної аутентифікації (2FA)

source: Google Authenticator for &lt;a href=&quot;{3}&quot;&gt;Android&lt;/a&gt; and &lt;a href=&quot;{4}&quot;&gt;iOS&lt;/a&gt;.
uk_ua: Google Authenticator для <a href="{3}"> Android </a> и <a href="{4}"> iOS</a>.

source: Grade
uk_ua: Якість

source: Hello
uk_ua: Привіт

source: Hello {0}!
uk_ua: Доброго дня, {0}!

source: Home
uk_ua: Головна

source: Incorrect password.
uk_ua: Невірний пароль.

source: Invalid authenticator code.
uk_ua: Невірний код аутентифікації.

source: Invalid login attempt.
uk_ua: Невірна спроба входу.

source: Invalid recovery code entered.
uk_ua: Введено невірний код відновлення.

source: Invalid token.
uk_ua: Неприпустимий токен.

source: IsCancelated
uk_ua: Гашена

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
uk_ua: IsValid (значення об'єкта) не був реалізований цим класом. Пріоритетна точка входу GetValidationResult () і класи повинні перевизначити IsValid (значення об'єкта, ValidationContext контекст).

source: Learn about &lt;a href=&quot;{0}&quot;&gt;building Web apps with ASP.NET Core&lt;/a&gt;.
uk_ua: Детальніше про <a href="{0}"> створення веб-додатків з ASP.NET Core </a>.

source: Locked out
uk_ua: Заблокований

source: Lockout is not enabled for this user.
uk_ua: Блокування не включено для цього користувача.

source: Log in
uk_ua: Вхід

source: Log in using your external account
uk_ua: Увійти за допомогою зовнішнього облікового запису

source: Log out
uk_ua: Вийти

source: Login
uk_ua: Вхід

source: Logout
uk_ua: Вийти

source: Manage
uk_ua: Управління

source: Manage your account
uk_ua: Управління вашим обліковим записом

source: Manage your external logins
uk_ua: Управління зовнішніми логінами

source: Material
uk_ua: Матеріал

source: Materials
uk_ua: Матеріали

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
uk_ua: MaxLengthAttribute повинен мати значення довжини, яке більше нуля. Використовуйте MaxLength () без параметрів, щоб вказати, що рядок або масив може мати максимально допустиму довжину.

source: MetadataClassType cannot be null.
uk_ua: MetadataClassType не може бути порожнім.

source: MinLengthAttribute must have a Length value that is zero or greater.
uk_ua: MinLengthAttribute повинен мати значення довжини, що дорівнює нулю або більше.

source: MyCollections
uk_ua: Мої Колекції

source: Name
uk_ua: Ім'я

source: Next
uk_ua: Наступна

source: Nominal
uk_ua: Номінал

source: Note
uk_ua: Примітка

source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
uk_ua: Після того, як ви зісканували QR-код або ввели ключ вище, додаток двофакторної аутентифікації надасть вам унікальний код. Введіть код в поле підтвердження нижче.

source: Optimistic concurrency failure, object has been modified.
uk_ua: Помилка оптимістичного паралелізму, об'єкт був змінений.

source: Password
uk_ua: Пароль

source: Password not correct.
uk_ua: Пароль невірний.

source: Password1
uk_ua: Пароль

source: Passwords must be at least {0} characters.
uk_ua: Паролі повинні містити не менше {0} символів.

source: Passwords must have at least one digit ('0'-'9').
uk_ua: Паролі повинні містити принаймні одну цифру.

source: Passwords must have at least one lowercase ('a'-'z').
uk_ua: Паролі повинні мати хоча б одну малу літеру ('a' - 'z').

source: Passwords must have at least one non alphanumeric character.
uk_ua: Паролі повинні містити хоча б один не буквено-цифровий символ.

source: Passwords must have at least one uppercase ('A'-'Z').
uk_ua: Паролі повинні містити хоча б одну велику літеру ('A' - 'Z').

source: Passwords must use at least {0} different characters.
uk_ua: Паролі повинні містити не менше {0} різних символів.

source: Personal Data
uk_ua: Особисті дані

source: Persons
uk_ua: Персони

source: Photo
uk_ua: Фотографія

source: Please check your email to reset your password.
uk_ua: Будь ласка, перевірте свою електронну пошту для скидання пароля.

source: Please confirm your account by &lt;a href='{0}'&gt;clicking here&lt;/a&gt;.
uk_ua: Будь ласка, підтвердіть свій аккаунт, <a href='{0}'> натиснувши тут </a>.

source: Please enter a valid number.
uk_ua: Будь ласка, введіть коректне число.

source: Please reset your password by &lt;a href='{0}'&gt;clicking here&lt;/a&gt;.
uk_ua: Скиньте пароль, <a href='{0}'> натиснувши тут </a>.

source: Previous
uk_ua: Попередня

source: Price
uk_ua: Ціна

source: Privacy
uk_ua: Конфіденційність

source: Privacy Policy
uk_ua: Політика конфіденційності

source: Profile
uk_ua: Профіль

source: Recovery code redemption failed.
uk_ua: Помилка відновлення коду.

source: Recovery code verification
uk_ua: Код підтвердження для відновлення

source: Register
uk_ua: Реєстрація

source: Register as a new user
uk_ua: Зареєструватися як новий користувач

source: Registered Logins
uk_ua: Зареєстровані Логіни

source: Remember me?
uk_ua: Запам'ятай мене?

source: Remove this login from your account
uk_ua: Видалити цей логін з вашого облікового запису

source: Remove {0}
uk_ua: Видалити {0}

source: Request ID:
uk_ua: Запит ID:

source: Reset
uk_ua: Скидання

source: Reset authenticator app
uk_ua: Скидання додатку перевірки автентичності

source: Reset authenticator key
uk_ua: Скидання ключа аутентифікації

source: Reset password
uk_ua: Скидання пароля

source: Reset password confirmation
uk_ua: Скинути підтвердження пароля

source: Reset recovery codes
uk_ua: Скинути коди відновлення

source: Reset your password.
uk_ua: Скинути пароль.

source: Revers
uk_ua: Фотографія зворотної сторони

source: Role name '{0}' is already taken.
uk_ua: Ім'я ролі '{0}' вже зайнято.

source: Role name '{0}' is invalid.
uk_ua: Ім'я ролі '{0}' є недійсним.

source: RoleManager
uk_ua: Менеджер Ролей

source: Sample Form
uk_ua: Зразок форми

source: Save
uk_ua: Зберегти

source: Search
uk_ua: Пошук

source: SelectCountry
uk_ua: Виберіть країну

source: SelectCurrency
uk_ua: Виберіть валюту

source: SelectDime
uk_ua: Виберіть копійку

source: SelectGrade
uk_ua: Виберіть якість

source: SelectSignature
uk_ua: Виберіть підпис

source: Send verification email
uk_ua: Надіслати лист із підтвердженням

source: Set password
uk_ua: Установка пароля

source: Settings
uk_ua: Налаштування

source: Setup authenticator app
uk_ua: Налаштування програми автентифікатора

source: Signature
uk_ua: Підпис

source: Signatures
uk_ua: Підписи

source: Stamp
uk_ua: Марка

source: StampGrades
uk_ua: Якість Марок

source: Stamps
uk_ua: Марки

source: StampsCollectionDescription
uk_ua: Ось моя колекція марок.

source: StampTypes
uk_ua: Типи Марок

source: Submit
uk_ua: Надіслати

source: Thank you for confirming your email.
uk_ua: Дякуємо Вам за підтвердження вашої електронної пошти.

source: The argument '{0}' cannot be null, empty or contain only whitespace.
uk_ua: Аргумент '{0}' не може бути нульовим, порожнім або містити тільки пробіл.

source: The associated metadata type for type '{0}' contains the following unknown properties or fields: {1}. Please make sure that the names of these members match the names of the properties on the main type.
uk_ua: Пов'язаний тип метаданих для типу '{0}' містить наступні невідомі властивості або поля: {1}. Будь ласка, переконайтеся, що імена цих членів збігаються з іменами властивостей основного типу.

source: The current browser has been forgotten. When you login again from this browser you will be prompted for your 2fa code.
uk_ua: В даний час браузер був забутий. При вході знову від цього браузера буде запропоновано ввести свій код 2FA.

source: The custom DataType string cannot be null or empty.
uk_ua: Рядок DataType користувача не може бути нульовим або порожнім.

source: The custom validation type '{0}' must be public.
uk_ua: Тип перевірки '{0}' користувача повинен бути публічним.

source: The CustomValidationAttribute method '{0}' does not exist in type '{1}' or is not public and static.
uk_ua: Метод CustomValidationAttribute '{0}' не існує в типі "{1} 'або не є загальнодоступним і статичним.

source: The CustomValidationAttribute method '{0}' in type '{1}' must match the expected signature: public static ValidationResult {0}(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
uk_ua: Метод CustomValidationAttribute '{0}' в типі "{1} 'повинен відповідати очікуваної підписи: public static ValidationResult {0} (object value, ValidationContext context). Значення може бути типізованим. Параметр ValidationContext є необов'язковим.

source: The CustomValidationAttribute method '{0}' in type '{1}' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
uk_ua: Метод CustomValidationAttribute '{0}' типу '{1} 'повинен повертати System.ComponentModel.DataAnnotations.ValidationResult. Використовуйте System.ComponentModel.DataAnnotations.ValidationResult.Success при успіху.

source: The CustomValidationAttribute.Method was not specified.
uk_ua: CustomValidationAttribute.Method не було зазначено.

source: The CustomValidationAttribute.ValidatorType was not specified.
uk_ua: CustomValidationAttribute.ValidatorType не було зазначено.

source: The external login was added.
uk_ua: Внешний логин был добавлен.

source: The external login was removed.
uk_ua: Зовнішній логін був видалений.

source: The field must be a number.
uk_ua: Поле має бути числом.

source: The field of type {0} must be a string, array or ICollection type.
uk_ua: Поле типу {0} має бути рядком, масивом або типом ICollection.

source: The field {0} is invalid.
uk_ua: Поле '{0}' є неприпустимим.

source: The field {0} must be a number.
uk_ua: Поле '{0}' має бути числом.

source: The field {0} must be a string or array type with a maximum length of '{1}'.
uk_ua: Поле '{0}' має мати тип рядка або масиву з максимальною довжиною '{1}'.

source: The field {0} must be a string or array type with a minimum length of '{1}'.
uk_ua: Поле '{0}' має бути типом рядка або масиву з мінімальною довжиною {1}.

source: The field {0} must be a string with a maximum length of {1}.
uk_ua: Поле '{0}' має бути рядком з максимальною довжиною {1}.

source: The field {0} must be a string with a minimum length of {2} and a maximum length of {1}.
uk_ua: Поле '{0}' має бути рядком з довжиною від {2} по {1}.

source: The field {0} must be between {1} and {2}.
uk_ua: Поле '{0}' має бути між {1} і {2}.

source: The field {0} must match the regular expression '{1}'.
uk_ua: Поле '{0}' має відповідати регулярному виразу "{1} '.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
uk_ua: Наданий екземпляр повинен відповідати ObjectInstance в наданому ValidationContext.

source: The key parameter at position {0} is null. Every key control parameter must be a string.
uk_ua: Ключовий параметр в позиції {0} є нульовим. Кожен ключовий параметр управління повинен бути рядком.

source: The key parameter at position {0} with value '{1}' is not a string. Every key control parameter must be a string.
uk_ua: Ключовий параметр в позиції {0} зі значенням '{1}' не є рядком. Кожен ключовий параметр управління повинен бути рядком.

source: The key parameter at position {0} with value '{1}' occurs more than once.
uk_ua: Ключовий параметр в позиції {0} зі значенням '{1}' зустрічається більше одного разу.

source: The maximum length must be a nonnegative integer.
uk_ua: Максимальна довжина повинна бути не негативним цілим числом.

source: The maximum value '{0}' must be greater than or equal to the minimum value '{1}'.
uk_ua: Максимальне значення {0} має бути більше або дорівнювати мінімальному значенню {1}.

source: The minimum and maximum values must be set.
uk_ua: Мінімальна і максимальна значення повинні бути встановлені.

source: The number of control parameters must be even.
uk_ua: Кількість контрольних параметрів повинно бути парним.

source: The OperandType must be set when strings are used for minimum and maximum values.
uk_ua: OperandType повинен бути встановлений, коли рядки використовуються для мінімальних і максимальних значень.

source: The pattern must be set to a valid regular expression.
uk_ua: Шаблон повинен бути встановлений в правильний регулярний вираз.

source: The property '{0}' on resource type '{1}' is not a string type.
uk_ua: Властивість '{0}' для типу ресурсу "{1} 'не є строковим типом.

source: The property {0}.{1} could not be found.
uk_ua: Властивість {0}.{1} не може бути знайдено.

source: The resource type '{0}' does not have an accessible static property named '{1}'.
uk_ua: Тип ресурсу '{0}' не має доступної статичної властивості з ім'ям '{1} '.

source: The supplied value is invalid for {0}.
uk_ua: Надане значення неприпустимо для {0}.

source: The supplied value is invalid.
uk_ua: Надане значення недійсне.

source: The type '{0}' does not contain a public property named '{1}'.
uk_ua: Тип '{0}' не містить публічної властивості з ім'ям '{1} '.

source: The type '{0}' needs to represent an enumeration type.
uk_ua: Тип '{0}' повинен являти собою тип перерахування.

source: The type provided for EnumDataTypeAttribute cannot be null.
uk_ua: Тип, наданий для EnumDataTypeAttribute, не може бути нульовим.
