using Microsoft.EntityFrameworkCore;
using MyCollection.Models;

namespace MyCollection.Data
{
    public static class DbInitializer
    {
        public static void Initialize(MyCollectionContext context)
        {
            context.Database.Migrate();
            bool saveData = false;
            if (!context.BoneGrades.Any())
            {
                var grades = new List<BoneGrade> {
                new BoneGrade{ Code = "UNC",
                               Name = "Uncirculated",
                               Description = "Грошовий знак, що не циркулював, не має абсолютно ніяких слідів зносу або навіть наклейок. Папір чистий, без плям, кольори не змінені. Кути гострі, прямі. Немає жодного округлення, вигину чи дірочки. Без слідів обробки чи витримки під пресом. Грошовий знак у ідеальному стані. Має свій оригінальний природний блиск."
                },
                new BoneGrade{ Code = "aUNC",
                               Name = "about Uncirculated",
                               Description = "Грошовий знак, що майже не циркулював, з деяким незначним зносом. Може мати слід від мокрих рук банківського касира, або незначний згин, що піддається вирівнюванню, посередині або збоку (але не злам!). Європейці часто означають AU як EF-Unc."
                },
                new BoneGrade{ Code = "XF",
                               Name = "Extremely Fine)",
                               Description = "'Надзвичайно прекрасний стан'. Дуже привабливий знак з легким зносом. Може мати не більше трьох легких згинів, поперечних або поздовжніх (але не перетинаються!) або один сильний злам. Папір чистий, кольори не змінені, плям немає. Кути можуть мати легкі ознаки заокруглення. Знак може мати легке зношування на краю вигину."
                },
                new BoneGrade{ Code = "VF",
                               Name = "Very Fine ",
                               Description = "'Дуже прекрасний стан'. Привабливі знак, але має помітні сліди обертання. Може мати кілька поздовжніх і поперечних вигинів одночасно, але папір все ще свіжий, не старий і не «зжований». Можуть бути сліди невеликих плям. Кути злегка пошарпані, але великих заокруглень немає."
                },
                new BoneGrade{ Code = "F",
                               Name = "Fine",
                               Description = "'Прекрасний стан'. Грошовий знак, який мав довге ходіння, з великою кількістю вигинів, зламів та зморшок. Папір не дуже брудний, але може мати плями. Грані можуть мати велику обшарпаність, з невеликими надривами по краю. Надриви не простягаються углиб знака. Немає жодної дірочки в центрі через згортання. Кольори зрозумілі, але вже не дуже яскраві."
                },
                new BoneGrade{ Code = "VG",
                               Name = "Very Good",
                               Description = "'Дуже хороший стан'. Багаторазово використаний грошовий знак, але не пошкоджений. Кути можуть мати помітні ознаки зношування та округлення, а також наклейки. Надриви можуть простягатися вглиб символу, можливо зміна кольорів, може бути невелика дірочка в центрі символу від надмірного згортання. Жодні частини знака не можуть бути вирвані. Грошовий знак категорії VG може мати все ще привабливий вигляд."
                },
                new BoneGrade{ Code = "G",
                               Name = "Good",
                               Description = "'Хороший стан'. Сильно пошматований знак. Природне пошкодження від тривалого обігу може включати: сильні багаторазові вигини та злами, плями, дірочки, надриви краю, протерту дірочку в центрі, заокруглені кути та взагалі непривабливий вигляд. Жодні великі частини знака не можуть бути відсутніми. Незмивні (нестираються) сторонні написи зазвичай «зсувають» навіть нову бону в категорію Good."
                },
                new BoneGrade{ Code = "FR",
                               Name = "Fair",
                               Description = "«Горілий» грошовий знак: повністю «кульгавий» (з безліччю зморшок), брудний і дуже зношений. Великі розриви, дірочки та забруднені ділянки. Фарби подекуди повністю вигоріли."
                },
                new BoneGrade{ Code = "PR",
                               Name = "Poor ",
                               Description = "'Ганчірка'. Грошовий знак із серйозними ушкодженнями через зношування: відсутні частини поля, є незмивні написи, чорнильні плями, дірки. Може мати склеювальну стрічку, що тримає частини знака разом. Може мати доклеєні кути. У колекцію включають лише у разі надзвичайної рідкості."
                }};
                context.BoneGrades.AddRange(grades);
                saveData = true;
            }

            if (saveData)
            {
                context.SaveChanges();
            }
        }
    }
}
